hurrican/wbci-acceptance-test/src/citrus/resources/de/mnet/wbci/acceptance/donating/cdm/v1/VaRrnpAbgStandardAblauf_01/VA_RRNP_ABG.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <v1:requestCarrierChange xmlns:v1="http://www.mnet.de/esb/cdm/SupplierPartner/CarrierNegotiationService/v1">
            <v1:VA-RRNP>
                <v1:absender>
                    <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
                </v1:absender>
                <v1:empfaenger>
                    <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
                </v1:empfaenger>
                <v1:version>2</v1:version>
                <v1:endkundenvertragspartner>
                    <v1:EKPauf>
                        <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
                    </v1:EKPauf>
                    <v1:EKPabg>
                        <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
                    </v1:EKPabg>
                </v1:endkundenvertragspartner>
                <v1:vorabstimmungsId>${preAgreementId}</v1:vorabstimmungsId>
                <v1:kundenwunschtermin>${requestedCustomerDate}</v1:kundenwunschtermin>
                <v1:endkunde>
                    <v1:person>
                        <v1:anrede>1</v1:anrede>
                        <v1:vorname>John</v1:vorname>
                        <v1:nachname>McFly</v1:nachname>
                    </v1:person>
                </v1:endkunde>
                <v1:weitereAnschlussinhaber>
                    <v1:person>
                        <v1:anrede>2</v1:anrede>
                        <v1:vorname>Kate</v1:vorname>
                        <v1:nachname>McFly</v1:nachname>
                    </v1:person>
                </v1:weitereAnschlussinhaber>
                <v1:projektId>
                    <v1:projektkenner>${wbciSimulatorUseCase}</v1:projektkenner>
                </v1:projektId>
                <v1:rufnummernPortierung>
                    <v1:anlagenanschluss>
                        <v1:onkzDurchwahlAbfragestelle>
                            <v1:ONKZ>89</v1:ONKZ>
                            <v1:durchwahlnummer>123456</v1:durchwahlnummer>
                            <v1:abfragestelle>0</v1:abfragestelle>
                        </v1:onkzDurchwahlAbfragestelle>
                        <v1:zuPortierenderRufnummernblock>
                            <v1:rnrBlockVon>00</v1:rnrBlockVon>
                            <v1:rnrBlockBis>99</v1:rnrBlockBis>
                        </v1:zuPortierenderRufnummernblock>
                    </v1:anlagenanschluss>
                    <v1:portierungszeitfenster>ZF2</v1:portierungszeitfenster>
                    <v1:portierungskennungPKIauf>D123</v1:portierungskennungPKIauf>
                </v1:rufnummernPortierung>
            </v1:VA-RRNP>
        </v1:requestCarrierChange>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>